Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: tm/All150502--omegat.tmx
Source language: en_us
Languages: ja

source: “With the level of investment from across the industry and technical contributions from some of the developer community’s best talent, the Cloud Native Computing Foundation is poised to advance the state of the art of application development at Internet scale.”
ja: 業界全体からの投資と、開発コミュニティの優秀な人材からの技術貢献を受け、Cloud Native Computing Foundation (CNCF) はインターネット スケールによる最先端のアプリケーション開発促進をめざしています。」

source: “With the release of SPDX 2.0, compliance is easier than ever before.”
ja: しかし SPDX 2.0 のリリースで、ライセンス準拠がこれまでになく簡単にできるようになります。」

source: • Contribute and influence the direction of AllJoyn services and features.
ja: AllJoyn のサービスや機能の方向付けに貢献・関与しませんか。

source: • Discover the AllJoyn Certification business advantage, and certify your product, app or service at allseenalliance.org/certification
ja: AllJoyn 認証の利点を知り、製品 / アプリ / サービスの認証を受けるには、こちらをご覧ください。allseenalliance.org/certification

source: • Discuss the development of AllJoyn® code and applications in the Forums at ask.allseenalliance.org
ja: AllJoyn® のコードやアプリケーションの開発について議論しませんか。ask.allseenalliance.org

source: • Download the Source Code at allseenalliance.org/framework/download
ja: ソースコードはこちらからダウンロードできます。allseenalliance.org/framework/download

source: • Find resources to help your team get going with development at wiki.allseenalliance.org/develop/overview
ja: 開発を始めるための豊富な情報源はこちら。wiki.allseenalliance.org/develop/overview

source: • Focus time and resources creating great products, applications and services, knowing AllJoyn Certified Products communicate simply and powerfully with each other today and in future roadmaps.
ja: AllJoyn Certified 製品は互いにシンプルに確実にやりとりできることが継続保証されますので、自社の製品 / アプリケーション / サービス開発に十分な時間とリソースをかけることができます。

source: • Follow AllJoyn on Hackster at www.hackster.io/alljoyn
ja: Hackster で AllJoyn をフォローしましょう。www.hackster.io/alljoyn

source: • Join the Mailing List at lists.allseenalliance.org
ja: さまざまなメーリングリストに登録できます。lists.allseenalliance.org

source: • Join the alliance and help shape AllJoyn’s future at allseenalliance.org/alliance/join-alliance
ja: AllSeen Alliance に参加し、AllJoyn の発展を支援してください。allseenalliance.org/alliance/join-alliance

source: • Leverage the AllJoyn Certified program for conformance testing and robust, real-world interoperability testing to help ensure that products work well together.
ja: 適合性検査と堅牢かつ現実的な相互運用性検査を行う AllJoyn Certified (AllJoyn 認証) プログラムは、製品間のスムーズなやりとりを保証します。

source: • Participate in User Groups at allseenalliance.org/framework/user-groups
ja: ユーザーグループに参加しましょう。allseenalliance.org/framework/user-groups

source: • Prepare your product for AllJoyn Certification by accessing all information about the program at allseenalliance.org/certification
ja: AllJoyn 認証を受けたい製品がある場合は、こちらをご覧ください。allseenalliance.org/certification

source: • View Case Studies and other Opportunities for Businesses at allseenalliance.org/opportunities/businesses
ja: ケース スタディや各種ビジネス チャンスについては、こちらでご覧いただけます。allseenalliance.org/opportunities/businesses

source: ● About the AGL Community
ja: AGL コミュニティ

source: ● Appception is a software development and services company with products and consulting services for the IoT and mobile device markets.
ja: Appception は、IoT やモバイル機器市場向けの製品とサービスを提供するソフトウェア開発・サービス企業です。

source: ● Automated testing infrastructure
ja: 自動検査基盤

source: ● Based in Palo Alto, Visible Energy Inc. helps companies to create IoT products.
ja: カリフォルニア州パロアルトを拠点とする Visible Energy Inc. は、IoT 製品の開発企業を支援しています。

source: ● CertiVox is one of the leading Internet cyber-security companies headquartered in the UK, with offices in San Francisco, Tokyo, and Dublin.
ja: CertiVoxはインターネットのサイバーセキュリティをリードする企業の1つで、本社はイギリスにあり、サンフランシスコ、東京、アイルランドのダブリンにオフィスがあります。

source: ● Common IVI layer that can be shared by multiple projects (AGL, GENIVI, others)
ja: 複数のプロジェクト (AGL、GENIVI、その他) が共有できる共通の IVI レイヤ

source: ● Complete Linux-based distribution based on Yocto Project
ja: Yocto Project をベースにした完全な Linux ベース ディストリビューション

source: ● Complete open source development infrastructure including Git code repositories, Gerrit code review and Jira bug and issues tracking, all hosted by the Linux Foundation
ja: Git コード リポジトリ、Gerrit コード レビュー、および Jira バグ・イシュー トラッキングなどの完全なオープン ソース開発基盤 (すべて Linux Foundation がホスト)

source: ● Continuous integration via Jenkins
ja: Jenkins による継続的な統合

source: ● Demo applications for Home Screen, Media Browser, HVAC Control and Display, AM/FM Radio and Navigation
ja: ホーム スクリーン、メディア ブラウザ、HVAC コントロール/ディスプレイ、AM/FM ラジオ、およびナビゲーションなどのデモ アプリケーション

source: ● Developer Resources
ja: 開発者リソース

source: ● Fabita, founded in 2010, is a manufacturing Italian company of cooker hoods and electric hobs – induction and ceramic – and customized household appliances.
ja: 2010 年創業の Fabita は、レンジフード、電気加熱調理器 (電磁・セラミック)、およびカスタム家電用品を専門とするイタリアの製造企業です。

source: ● First open source MOST device driver developed by Microchip Technology
ja: マイクロチップ技術で開発された最初のオープン ソース MOST デバイス ドライバー

source: ● Granite River Labs (GRL) specializes in enabling new and emerging technologies, working closely with early adopters, standards committees, and leading test equipment manufacturers to develop test methodologies and provide early test solutions.
ja: Granite River Labs (GRL) は、テスト手法の開発と早期テスト ソリューション提供をめざして、新興技術の実現に取り組み、アーリー アダプター、標準化委員会、主要テスト機器メーカーなどと密接に連携しています。

source: ● Hackster is a community of hardware makers and developers that inspire and teach each other how to create hardware devices.
ja: Hackster は、ハードウェア メーカーや開発者がハードウェア機器の開発について互いに啓発し学び合うコミュニティです。

source: ● IBM is a global technology and innovation company headquartered in Armonk, NY.
ja: IBM はニューヨーク州アーモンクに本社を置く世界的な技術イノベーション企業です。

source: ● It defines a highly integrated Linux-based software reference platform for IVI.
ja: 高度に統合された Linux ベースの IVI 向けソフトウェア リファレンス プラットフォームを定義している。

source: ● It defines both a native and HTML5 application framework.
ja: ネイティブと HTML5 のアプリケーション フレームワークをどちらも定義している。

source: ● It defines connectivity and interaction with the vehicle bus (CAN, MOST) with APIs for middleware and applications.
ja: ミドルウェアやアプリケーションに対応した API で、移動機械用バス (CAN、MOST) との相互通信を定義している。

source: ● It defines requirements for multiple services such as WiFi, Bluetooth, multimedia, location based services, application lifecycle management and several others.
ja: WiFi、Bluetooth、マルチメディア、位置情報サービス、アプリケーション ライフサイクル管理をはじめとするさまざまなサービスのための要件を定義している。

source: ● KONA S is a subsidiary of KONA International.
ja: KONA S は KONA International の子会社です。

source: ● Novatel Wireless, Inc. delivers intelligent wireless solutions that simplify the Internet of Things (IoT).
ja: Nvatel Wireless, Inc. は、Internet of Things (IoT) を簡略化する先進的ワイヤレス ソリューションを提供しています。

source: ● Omni m2m provides an IoT platform for developers and OEMs that enables manageability, automation and analytics with just a few lines of code.
ja: Omni m2m は、数行のコードで管理、自動化、および分析可能な IoT プラットフォームを開発者や OEM に提供しています。

source: ● Option for both native and HTML5 applications
ja: ネイティブ アプリと HTML5 アプリのオプション

source: ● Participating in Automotive Grade Linux
ja: Automotive Grade Linux への参加

source: ● Pivotal is a trusted partner for IT innovation and digital transformation, enabling enterprises to provide modern software-driven experiences for their customers and workforces.
ja: Pivotal は、IT イノベーションとデジタル変換の分野で信頼されるパートナーであり、企業が顧客や従業員に最新のソフトウェア主導エクスペリエンスを提供できるよう支援します。

source: ● Skyworth is a large-scale high-tech corporation mainly engaged in the development and manufacturing of consumption electronics, display devices, digital set top box, security monitors, network communication, semiconductors, fridges and washing machines, 3C digital and LED lighting.
ja: Skyworth は、消費者家電、ディスプレイ機器、デジタル セットトップボックス、セキュリティ モニター、ネットワーク通信、半導体、冷蔵庫、洗濯機、3C デジタル、および LED 照明などを開発製造している大規模ハイテク企業です。

source: ● Support for QT multimedia and QML applications
ja: QT マルチメディアと QML アプリケーションのサポート

source: ● TOPEAST provides packaged technological solutions to electrical household appliances, motors and electronic manufacturing enterprises.
ja: TOPEAST は、家電製品、モニター、電子機器などのメーカー企業に技術ソリューション パッケージを提供しています。

source: ● Various Intel boards such as the MinnowBoard MAX
ja: ● Intel の各種ボード (MinnowBoard MAX など)

source: ● Westin IVI shell with Wayland IVI extension (from GENIVI)
ja: Weston IVI shell と Wayland IVI extension (GENIVI 製)

source: ● AllSeen Blog
ja: AllSeen ブログ

source: ● How to Join
ja: 参加方法

source: ●Contribute AGL specific code to upstream projects where necessary
ja: ー AGL 固有コードをアップストリームに適宜提供

source: ●Develop reference distributions for multiple automotive applications
ja: さまざまな自動車アプリケーションに対応するリファレンス (基本) ディストリビューションの開発

source: ●Develop reference distributions on multiple hardware platforms
ja: さまざまなハードウェア プラットフォームで動くリファレンス ディストリビューションの開発

source: ●Develop requirements specifications
ja: 要求仕様の開発

source: ●Educate the industry in open source collaboration and best practices
ja: オープン ソース コラボレーションやベストプラクティスについて自動車業界を指導

source: ●In-Vehicle Infotainment (IVI), Cluster, HUD, Telematics, Control Systems
ja: ー 車載インフォテインメント (IVI)、クラスタ (デジタル計器盤)、ヘッドアップディスプレイ (HUD)、テレマティクス、制御システム

source: ●Open collaboration project to enable rapid innovation in the automotive industry by leveraging Linux and Open Source technologies
ja: Linux などのオープン ソース技術を利用して自動車業界のめざましい技術革新を実現するオープン コラボレーション プロジェクト

source: ●Which leads to implementation and creation of AGL software projects
ja: ー AGL ソフトウェア プロジェクトの実装・開発を先導

source: ●Work with upstream projects
ja: アップストリーム プロジェクトとの連携
